<?php

use yii\web\View;
use yii\helpers\Html;

/** @var $this View */

$this->title = 'Политика обработки персональных данных';
$this->registerMetaTag([
    'name' => 'description',
    'content' => 'Политика обработки персональных данных'
]);

$adminEmail = Yii::$app->params['adminEmail'];
?>
<main class="content">
    <div class="container">
        <div class="page-title">
            <h1 class="h3 text-uppercase">
                <b>Политика конфиденциальности персональных данных пользователей svezem.ru</b>
            </h1>
        </div>
        <p class="text-justify">
            Эта политика описывает, как ООО «Иновика» (далее по тексту «компания» или «мы») обрабатывает и защищает
            персональные данные пользователей интернет сервиса svezem.ru.ru (далее по тексту сервис).
        </p>
        <p class="text-justify">
            Политика применяется как к зарегистрированным, так и к незарегистрированным пользователям (далее по тексту
            «пользователи» или «вы»). Политика применяется не зависимо от устройства, с которого вы используете сервис,
            и не зависимо от канала связи, по которому вы обращаетесь.<br>
            Предоставляя нам персональные данные, вы даете согласие на их обработку в соответствии с этой политикой.
        </p>
        <ol>
            <li style="padding-bottom: 25px">
                <p><b>Определения</b></p>
                <p class="text-justify">
                    Персональные данные – любая информация, относящаяся к прямо или косвенно определенному, или
                    определяемому физическому лицу (субъекту персональных данных).<br>
                    Обработка персональных данных – осуществление любых действий или совокупности действий в отношении
                    персональных данных, включая сбор, запись, систематизацию, накопление, хранение, обновление и
                    изменение, извлечение, использование, передачу (распространение, предоставление, доступ),
                    блокирование, удаление и уничтожение – как с использованием, так и без использования средств
                    автоматизированной обработки данных.
                </p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Какие данные мы обрабатываем</b></p>
                <p class="text-justify">
                    Мы обрабатываем персональные и технические данные.<br>
                    Персональные данные, разрешённые к обработке в рамках настоящей политики включают в себя следующую
                    информацию:
                <ul>
                    <li>Фамилия, Имя, Отчество</li>
                    <li>Электронный адрес;</li>
                    <li>Номера телефонов;</li>
                    <li>Город нахождения;</li>
                    <li>Фотографии.</li>
                </ul>
                Вы предоставляете нам персональные данные, когда:
                <ul>
                    <li>регистрируетесь в сервисе;</li>
                    <li>используете сервис и услуги;</li>
                    <li>подписываетесь на рассылку;</li>
                    <li>размещаете объявления;</li>
                    <li>общаетесь с другими пользователями;</li>
                    <li>пишете или звоните нам.</li>
                </ul>
                Ваше устройство автоматически передает технические данные: информацию, сохраненную в файлах куки
                (cookies), информацию о браузере и его настройках, дате и времени доступа к сервису, адресах
                запрашиваемых страниц, действиях на сайте или в приложении, технических характеристиках устройства,
                IP-адресе и т.п.
                </p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Для чего мы обрабатываем данные</b></p>
                <p class="text-justify">
                    Мы обрабатываем персональные и технические данные, чтобы:
                <ul>
                    <li>предоставлять вам возможность пользоваться сервисом и услугами: создавать профиль, размещать
                        объявления, оплачивать услуги и т.п.;
                    </li>
                    <li>обеспечивать стабильную работу и безопасность сервиса, улучшать пользовательский опыт, качество
                        услуг и маркетинговых мероприятий компании;
                    </li>
                    <li>предупреждать и пресекать нарушения законодательства, Условий использования сервиса;</li>
                    <li>отвечать на ваши обращения;</li>
                    <li>выполнять обязанности, предусмотренные законодательством (например, для бухгалтерского учёта,
                        налоговой отчётности, ответов на запросы государственных органов);
                    </li>
                    <li>направлять маркетинговые сообщения сервиса и наших партнерах;</li>
                    <li>для других целей с вашего согласия.</li>
                </ul>
                </p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Правовые основания обработки</b></p>
                <p class="text-justify">
                    Мы обрабатываем ваши персональные данные:
                <ul>
                    <li>вашего согласия;</li>
                    <li>для заключения, исполнения, изменения или прекращения договора – Условий использования сервиса и
                        договора оказания услуг;
                    </li>
                    <li>для осуществления прав и законных интересов компании или третьих лиц, если при этом не
                        нарушаются ваши права и свободы;
                    </li>
                    <li>для выполнения обязанностей, возложенных на компанию законодательством;</li>
                    <li>если данные общедоступные (в отрытом доступе);</li>
                </ul>
                мы не обрабатываем специальные категории персональных данных. Мы не обрабатываем биометрические
                персональные данные для установления личности.
                </p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Передача третьим лицам. Трансграничная передача</b></p>
                <p class="text-justify">Мы можем передавать персональные данные или поручать их обработку третьим лицам.</p>
                <p class="text-justify">Мы передаем персональные данные только в те страны, которые обеспечивают их
                    адекватную защиту.</p>
                <p class="text-justify">Мы никогда не передадим ваши данные спамерам.</p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Сервис – общедоступный источник данных</b></p>
                <p class="text-justify">
                    Относитесь ответственно к размещению информации в интернете. Ваши объявления, отзывы и публичную
                    часть профиля сможет увидеть любой пользователь интернета, зайдя на сервис.<br>
                    Цель, с которой пользователи размещают данные в сервисе – установить контакт с потенциальным
                    заказчиком (клиентом, работодателем) и (или) с потенциальным исполнителем (перевозчиком), который
                    заинтересован в заключении сделки по объявлению. Запрещено обрабатывать данные пользователей для
                    любых других целей. Нельзя звонить пользователям, чтобы предлагать им свои услуги, не относящиеся к
                    тематике сервиса. Нельзя копировать данные пользователей, чтобы размещать и хранить их на других
                    сервисах. Нельзя использовать открытые данные для скоринга. Все это – незаконно.
                </p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Безопасность</b></p>
                <p class="text-justify">
                    Ответственное отношение к персональным данным – стандарт работы компании.<br>
                    Для защиты персональных данных, мы:
                <ul>
                    <li>утвердили и опубликовали на сайте политику конфиденциальности персональных данных пользователей
                        svezem.ru;
                    </li>
                    <li>утвердили список сотрудников, доступ которых к персональным данным, обрабатываемым в
                        информационной системе, необходим для выполнения ими служебных (трудовых) обязанностей;
                    </li>
                    <li>назначили лицо, ответственное за организацию обработки персональных данных;</li>
                    <li>регулярно проверяем процессы и документы компании на их соответствие закону;</li>
                    <li>оцениваем риски и вред, который можем причинить, если нарушим закон о персональных данных. С
                        учетом проведенной оценки подбираем подходящие меры для соблюдения закона;
                    </li>
                    <li>применяем правовые, организационные и технические меры, чтобы обеспечить безопасность
                        персональных данных.
                    </li>
                </ul>
                </p>

                <p class="text-justify">
                    Принимая меры по защите персональных данных, мы основываемся на:
                <ul>
                    <li>требованиях законодательства;</li>
                    <li>установленном уровне защищенности персональных данных;</li>
                    <li>актуальных угрозах;</li>
                    <li>базовом наборе мер защиты, установленном нормативными правовыми актами для соответствующего
                        уровня защищенности;
                    </li>
                    <li>приоритете законных интересов пользователей.</li>
                </ul>
                </p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Сроки обработки</b></p>
                <p class="text-justify">
                    Мы прекращаем обработку ваших персональных данных:
                <ul>
                    <li>по истечении срока согласия или при отзыве согласия (если нет других оснований для обработки,
                        предусмотренных законодательством);
                    </li>
                    <li>по достижении целей обработки либо при утрате необходимости в их достижении (если нет других
                        оснований для обработки, предусмотренных законодательством);
                    </li>
                    <li>при выявлении неправомерной обработки, если обеспечить правомерность невозможно;</li>
                    <li>при ликвидации компании.</li>
                </ul>
                </p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Связаться с нами</b></p>
                <p class="text-justify">Чтобы задать вопрос или отозвать согласие на обработку персональных данных,
                    обратитесь по адресу <a href="mailto:<?= $adminEmail ?>"> <?= $adminEmail ?></a></p>
            </li>

            <li style="padding-bottom: 25px">
                <p><b>Изменение политики</b></p>
                <p class="text-justify">
                    Мы обновляем политику по мере необходимости. Периодически проверяйте эту
                    страницу: <?= Html::a(Yii::$app->request->absoluteUrl, Yii::$app->request->absoluteUrl) ?>.
                    Продолжая использовать сервис после изменения политики, вы подтверждаете согласие с внесенными в нее
                    изменениями.
                </p>
            </li>
        </ol>
    </div>
</main>
